tutorial/blade/fluid-nofsi/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         pimpleFoam;
startFrom           latestTime;
startTime           0;
stopAt              endTime;
endTime             3;
deltaT              0.001;
writeControl        runTime;
writeInterval       0.025;
purgeWrite          0;
writeFormat         ascii;
writePrecision      6;
writeCompression    off;
timeFormat          general;
timePrecision       6;
runTimeModifiable   true;


functions
{    
    #include "forces"
}
