tutorial/blade/fluid-nofsi/0.orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/initialConditions";

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform $turbulentNuTilda;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    blade
    {
        type            fixedValue;
        value           uniform 0;
    }
    floor
    {
        type            symmetryPlane;
    }

    "externalDomain_.*"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
