tutorial/blade/fluid-nofsi/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/initialConditions";

dimensions      [0 2 -1 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    
    blade
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    floor
    {
        type            symmetryPlane;
    }

    "externalDomain_.*"
    {
        type            symmetryPlane;
    }

}


// ************************************************************************* //
